InformationRegisters/КодыСинхронизацииУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>КодыСинхронизацииУНФ</Name>
			<Comment>Вспомогательный регистр необходимый для обмена кодами с конфигурацией УНФ</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыСинхронизацииУНФ/Ext/ManagerModule.bsl
//Формирует записи в регистре коды синхронизации
//в случае изменения реквизита КодСинхронизации
Процедура ОбновитьКодСинхронизации(Номенклатура, НовыйКод) Экспорт
	
	Отбор = Новый Структура("Номенклатура", Номенклатура); 
	СрезПоследних = РегистрыСведений.КодыСинхронизацииУНФ.ПолучитьПоследнее(ТекущаяДата(),Отбор);	
	
	Если НЕ СрезПоследних.НовыйКод = НовыйКод Тогда
		НоваяЗапись = РегистрыСведений.КодыСинхронизацииУНФ.СоздатьМенеджерЗаписи();
		НоваяЗапись.Номенклатура = Номенклатура;
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.НовыйКод = НовыйКод;
		НоваяЗапись.Код = СрезПоследних.НовыйКод;
		НоваяЗапись.Записать();
	КонецЕсли;
	
КонецПроцедуры
